package com.java的数据类型;

//基本数据类型：四个整数类型，2个浮点类型，一种字符类型，还有一种布尔型

// 整数
// byte 最小值是 -128（-2^7）；
//      最大值是 127（2^7-1）；

// short 最小值是 -32768（-2^15）；
//      最大值是 32767（2^15 - 1）；

// int 最小值是 -2,147,483,648（-2^31）；
//      最大值是 2,147,483,647（2^31 - 1）；

//

// long 最小值是 -9,223,372,036,854,775,808（-2^63）；
//      最大值是 9,223,372,036,854,775,807（2^63 -1）；
// 注意：数字后面需要加上L：例子： long a = 100000L，long b = -200000L。

// 浮点数
//  float 数据类型是单精度、32位
//  double 数据类型是双精度、64 位

// 引用数据类型：Integer 数组和集合中的使用：由于 int 是基本类型，
// 不能直接存储在数组和集合这样的数据结构中。
// 因此，通常需要使用 Integer 类型的对象来代替 int，
// 以便在数组和集合中进行存储和操作。
public class index {
}
